{
        "intents": [
            {
                "tag": "crop_information",
                "patterns": [
                    "What is the growth stage of corn?",
                    "How do I deal with pests on my tomato plants?",
                    "What are the ideal growing conditions for soybeans?"
                ],
                "responses": [
                    "Corn typically goes through the vegetative, reproductive, and maturation stages.",
                    "Tomato plants can be susceptible to pests like aphids and tomato hornworms. You can use insecticidal soap or neem oil to control them.",
                    "Soybeans prefer well-drained soil and moderate temperatures. They also require plenty of sunlight and water."
                ]
            },
            {
                "tag": "weather_forecast",
                "patterns": [
                    "What's the forecast for tomorrow?",
                    "Is it going to rain next week?",
                    "How hot will it be today?"
                ],
                "responses": [
                    "I'm sorry, I am not able to provide weather forecast, you can check your local weather channel or website.",
                    "I'm sorry, I am not able to provide weather forecast, you can check your local weather channel or website.",
                    "I'm sorry, I am not able to provide weather forecast, you can check your local weather channel or website."
                ]
            },
            {
                "tag": "market_prices",
                "patterns": [
                    "What's the current price of wheat?",
                    "How has the price of corn changed in the last month?",
                    "Will the price of soybeans go up in the next six months?"
                ],
                "responses": [
                    "I'm sorry, I am not able to provide market prices, you can check your local market or online commodity trading platforms.",
                    "I'm sorry, I am not able to provide market prices, you can check your local market or online commodity trading platforms.",
                    "I'm sorry, I am not able to provide market prices, you can check your local market or online commodity trading platforms."
                ]
            },
            {
                "tag": "agricultural_news",
                "patterns": [
                    "What's new in the agricultural industry?",
                    "Have there been any recent developments in farming technology?",
                    "Are there any new policies affecting farmers?"
                ],
                "responses": [
                    "I'm sorry, I am not able to provide agricultural news, you can check online agricultural news websites."
                ]
            }
        ]
}
